meshGenTesting/rect1Base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       2840;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       2850;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          150;
        startFace       2860;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          150;
        startFace       3010;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3000;
        startFace       3160;
    }
)

// ************************************************************************* //
